Revit 2027 API
AppearanceAssetEditScope.Start Method
 Starts the edit scope.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Asset Start(
	ElementId assetElementId
)
Public Function Start (
	assetElementId As ElementId
) As Asset
public:
Asset^ Start(
	ElementId^ assetElementId
)
member Start :
        assetElementId : ElementId -> Asset
Parameters
assetElementId ElementId
 The appearance asset element whose asset should be edited.
Return Value
Asset
 The appearance asset to be used for editing.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AppearanceAssetEditScope Class
Autodesk.Revit.DB.Visual Namespace